; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-6-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-3 - location
	p2-3 - location
	p3-4 - location
	p4-2 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at package1 s1)
	(at package2 s4)
	(at package3 s0)
	(at package4 s2)
	(at package5 s4)
	(at package6 s1)
	(at package7 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 30)
	(= (time-to-walk p0-1 s0) 30)
	(= (time-to-walk s1 p0-1) 88)
	(= (time-to-walk p0-1 s1) 88)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 58)
	(= (time-to-walk p0-3 s0) 58)
	(= (time-to-walk s3 p0-3) 60)
	(= (time-to-walk p0-3 s3) 60)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 59)
	(= (time-to-walk p2-3 s2) 59)
	(= (time-to-walk s3 p2-3) 2)
	(= (time-to-walk p2-3 s3) 2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 1)
	(= (time-to-walk p3-4 s3) 1)
	(= (time-to-walk s4 p3-4) 41)
	(= (time-to-walk p3-4 s4) 41)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 23)
	(= (time-to-walk p4-2 s4) 23)
	(= (time-to-walk s2 p4-2) 45)
	(= (time-to-walk p4-2 s2) 45)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 66)
	(= (time-to-drive s3 s0) 66)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 53)
	(= (time-to-drive s4 s0) 53)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 16)
	(= (time-to-drive s0 s2) 16)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 63)
	(= (time-to-drive s1 s2) 63)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 78)
	(= (time-to-drive s4 s2) 78)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 66)
	(= (time-to-drive s2 s3) 66)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 81)
	(= (time-to-drive s4 s3) 81)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 78)
	(= (time-to-drive s1 s4) 78)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver3 s2)
	(at truck1 s0)
	(at truck3 s0)
	(at truck5 s2)
	(at truck6 s1)
	(at package1 s1)
	(at package2 s1)
	(at package4 s2)
	(at package5 s4)
	(at package6 s3)
	(at package7 s2)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 2  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver1 s0 p0-1)
   deleted: (at driver1 s0)
   added: (at driver1 p0-1)
   changed: (walked) from 0 to 30
   goals met: 4 of 12
2. (walk driver1 p0-1 s1)
   deleted: (at driver1 p0-1)
   added: (at driver1 s1)
   changed: (walked) from 30 to 118
   goals met: 5 of 12
3. (board-truck driver2 truck6 s4)
   deleted: (at driver2 s4) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 5 of 12
4. (board-truck driver3 truck5 s3)
   deleted: (at driver3 s3) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 5 of 12
5. (load-truck package2 truck6 s4)
   deleted: (at package2 s4)
   added: (in package2 truck6)
   goals met: 5 of 12
6. (drive-truck truck5 s3 s2 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (driven) from 0 to 66
   goals met: 6 of 12
7. (walk driver4 s2 p2-3)
   deleted: (at driver4 s2)
   added: (at driver4 p2-3)
   changed: (walked) from 118 to 177
   goals met: 6 of 12
8. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 7 of 12
9. (walk driver4 p2-3 s3)
   deleted: (at driver4 p2-3)
   added: (at driver4 s3)
   changed: (walked) from 177 to 179
   goals met: 7 of 12
10. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 7 of 12
11. (drive-truck truck3 s3 s0 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (driven) from 66 to 132
   goals met: 8 of 12
12. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 12
13. (drive-truck truck6 s4 s1 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   changed: (driven) from 132 to 210
   goals met: 8 of 12
14. (unload-truck package2 truck6 s1)
   deleted: (in package2 truck6)
   added: (at package2 s1)
   goals met: 9 of 12
15. (load-truck package6 truck6 s1)
   deleted: (at package6 s1)
   added: (in package6 truck6)
   goals met: 9 of 12
16. (drive-truck truck6 s1 s4 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   changed: (driven) from 210 to 288
   goals met: 8 of 12
17. (drive-truck truck6 s4 s3 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s3)
   changed: (driven) from 288 to 369
   goals met: 8 of 12
18. (unload-truck package6 truck6 s3)
   deleted: (in package6 truck6)
   added: (at package6 s3)
   goals met: 9 of 12
19. (drive-truck truck6 s3 s2 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   changed: (driven) from 369 to 435
   goals met: 9 of 12
20. (drive-truck truck6 s2 s1 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s1)
   changed: (driven) from 435 to 498
   goals met: 10 of 12
21. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 11 of 12
22. (disembark-truck driver2 truck6 s1)
   deleted: (driving driver2 truck6)
   added: (at driver2 s1) (empty truck6)
   goals met: 11 of 12
23. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 11 of 12
24. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (driven) from 498 to 576
   goals met: 11 of 12
25. (drive-truck truck1 s4 s0 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 576 to 629
   goals met: 12 of 12
